tutorials/channelOodles/channel395/0.org/U
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.1335 0 0);

boundaryField
{
    bottomWall      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    topWall         
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    sides1          
    {
        type            cyclic;
    }

    sides2          
    {
        type            cyclic;
    }

    inout1          
    {
        type            cyclic;
    }

    inout2          
    {
        type            cyclic;
    }
}


// ************************************************************************* //
