tutorials/channelOodles/channel395/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 0)
    (4 0 0)
    (0 1 0)
    (4 1 0)
    (0 2 0)
    (4 2 0)
    (0 0 2)
    (4 0 2)
    (0 1 2)
    (4 1 2)
    (0 2 2)
    (4 2 2)
);

blocks          
(
    hex (0 1 3 2 6 7 9 8) (40 25 30) simpleGrading (1 10.7028 1)
    hex (2 3 5 4 8 9 11 10) (40 25 30) simpleGrading (1 0.0984 1)
);

edges           
(
);

patches         
(
    wall bottomWall 
    (
        (0 1 7 6)
    )
    wall topWall 
    (
        (4 10 11 5)
    )
    cyclic sides1 
    (
        (0 2 3 1)
        (6 7 9 8)
    )
    cyclic sides2 
    (
        (2 4 5 3)
        (8 9 11 10)
    )
    cyclic inout1 
    (
        (1 3 9 7)
        (0 6 8 2)
    )
    cyclic inout2 
    (
        (3 5 11 9)
        (2 8 10 4)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
